app/views/books/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 7]]
---
      <div class="average-review-rating" data-score="<%= @average_review %>"></div>
      <span class="numer-of-reviews">Based on <%= @book.reviews.count %> reviews</span>