app/controllers/books_controller.rb

SELECT "categories".* FROM "categories" ORDER BY name ASC
SELECT "books".* FROM "books" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "RPG"], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ? ORDER BY created_at DESC  [["category_id", 5]]
---
  def index
    if params[:category].blank?
      @books = Book.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @books = Book.where(category_id: @category_id).order("created_at DESC")

SELECT "categories".* FROM "categories" ORDER BY name DESC
---
  def new
    @book = current_user.books.build
    @categories = Category.all.order("name ASC").map{ |c| [c.name, c.id] }

INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "1"], ["description", "2"], ["author", "3"], ["created_at", 2017-04-17 16:10:03 UTC], ["updated_at", 2017-04-17 16:10:03 UTC]]
---
  def create
    @book = current_user.books.build(book_params)
    @book.category_id = params[:category_id]

    if @book.save

SELECT "categories".* FROM "categories" ORDER BY name ASC
---
  def edit
    @categories = Category.all.map{ |c| [c.name, c.id] }

UPDATE "books" SET "book_img_file_name" = ?, "book_img_content_type" = ?, "book_img_file_size" = ?, "book_img_updated_at" = ?, "updated_at" = ? WHERE "books"."id" = ?
---
  def update
    @book.category_id = params[:category_id]
    if @book.update(book_params)