app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "review 1 by me"], ["created_at", 2017-04-22 11:11:18 UTC], ["updated_at", 2017-04-22 11:11:18 UTC], ["user_id", 1], ["book_id", 7]]
---
  def create
    @review = Review.new(review_params)
    @review.book_id = @book.id
    @review.user_id = current_user.id

    if @review.save

UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "review 1 by me, edited"], ["updated_at", 2017-04-23 05:31:12 UTC], ["id", 1]]
---
  def update
    if @review.update(review_params)